{
  "page": {
    "title": "Bem vindo!",
    "heroBox": "Esse é meu espaço para apresentar-me e mostrar minhas habilidades como desenvolvedor com projetos de estudo, úteis, ou apenas divertidos!"
  },
  "components": {
    "presentationBox": {
      "Sobre": {
        "title": "Olá! ",
        "link": "https://www.linkedin.com/in/viniciuscoelho1995/",
        "content": {
          "Quem sou eu": "Meu nome é vinicius, nascido em 95, observei as tecnologias que usamos em nosso dia a dia serem desenvolvidas junto comigo, sempre tive o impulso de aprender como as coisas funcionam e de tirar o máximo delas, principalmente no âmbito profissional",
          "Experiencia": "Com relação a informática tenho dois estágios: fui suporte de TI na época do segundo grau e com a faculdade web developer fullstack, onde tive contato com tecnologias que uso nesse site!"
        }
      },
      "projetos": {
        "title": "Um pouco do meu trabalho: ",
        "link": "https://www.github.com/Vinicielho/",
        "content": {
          "Interesses": "É bem gratificante criar coisas úteis, as vezes passamos por certas dificuldades ou trabalhos que não tem uma solução simples e nos perguntamos por que tem que ser assim? Essas situações ocorrem bastante comigo e amo fazer algo sobre isso!",
          "Ética de trabalho": "Software é muito prevalente em nossas vidas porém por quanto que funcione não pensamos muito sobre, mas há tópicos muito importantes relativos aos métodos e execução de um projeto e seu ciclo de vida eisso tudo reflete no produto final e seu impacto."
        },
        "subtheme": {
          "Portfolio Website": {
            "title": "Este site aqui!",
            "link": "https://www.github.com/Vinicielho/portfolio-website",
            "content": {
              "O que tem de interessante?": "Usando o framework next.js temos a oportunidade de criar muitas coisas legais, por enquanto tenho alguns sistemas interessantes que estão funcionando:",
              "Internationalização": "Usando a biblioteca next-intl temos uma implementação elegante que é construida por cima dos fundamentos do next.js. Com ela, e um bastante carinho pra escrever tudo em duas linguas, tenho a oportunidade de me expressar com mais gente que possa se interessar!",
              "Temas": "Usando a biblioteca next-themes temos uma solução elegante para alguns problemas que temos com temas nesse tipo de sistema, onde por causa do server-side rendering, o site 'pisca' ao ser enviado usando um tema e percebendo que o usuário prefere outro, e eu prefiro não jogar uma flashbang nos outros. hehe",
              "O que mais?": "Pretendo fazer muito mais, até agora escolhi usar bibliotecas disponíveis tanto para mostrar que consigo interagir com o código de outros quanto pra resolver esses problemas menores com mais agilidade, porém é claro, chega a hora que precisamos botar a mão na massa e tem muitas coisas que um website pode fazer e eu quero mostrar que eu também posso! Então talvez um arcade com sistema de placar que mandar uma mensagem quando seu recorde é vencido? envolveria umas boas mecanicas para fazer funcionar!"
            }
          },
          "IA medidora de agua/gás!": {
            "title": "Automação de leituras",
            "link": "https://github.com/Vinicielho/shopper-test",
            "content": {
              "O que?": "Usando uma api da gemni API, esse programa envia uma imagem em base-64 junto com um prompt, perguntando qual o valor do relógio de agua ou gás na foto. E então coleta algumas outras informações do pedido em si e salva as devidas informações no banco de dados.",
              "Por que?": "Foi um desafio proposto por uma entrevista de emprego, foi um desafio interessante, pois até então nao tinha usado essas tecnologias para criar um serviço de backend, tive que conhecer as bibliotecas de react que me ajudariam a fazer alguams coisas como os pedidos HTTP e o driver do banco de dados por exemplo.",
              "Como?": "Requisições técnicas: Queriam um projeto rodando em node.JS com typescript e salvando as coisas em um banco de dados PostgreSQL e tudo tinha que subir com um único docker-compose, a gemni API tinha uma biblioteca para fazer os pedidos, porém usa-la foi mais complicado que esperado pois a documentação era bem simples e não se encaixava exatamente nos meus métodos, porém eventualmente consegui usa-la. O resto foram situações bem simples de fazer pedidos HTTP e interagir com bancos relacionais de qualquer outro CRUD que eu sei que vocês já viram. :)"
            }
          },
          "Java Crud": {
            "title": "Estudo backend",
            "link": "https://www.github.com/Vinicielho/",
            "content": {
              "Cadê?": "É o meu projeto atual, eu já fiz uns dois antes e gostaria de deixar um decente por aqui para demonstrações porém estudos ficaram no caminho do último."
            }
          }
        }
      }
    },
    "footer": {
      "thanks": "Obrigado por seu tempo, com este ponto de contato espero que possa criar conexões tanto com empregadores quanto com pessoas similares e que possamos trabalhar juntos de alguma forma!",
      "contact": "Contate-me:"
    }
  }
}
